balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GB004.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCXORH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCXORH" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="X16" edc:desc="" edc:mask="0x1" edc:name="X16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X17" edc:desc="" edc:mask="0x1" edc:name="X17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X18" edc:desc="" edc:mask="0x1" edc:name="X18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X19" edc:desc="" edc:mask="0x1" edc:name="X19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X20" edc:desc="" edc:mask="0x1" edc:name="X20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X21" edc:desc="" edc:mask="0x1" edc:name="X21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X22" edc:desc="" edc:mask="0x1" edc:name="X22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X23" edc:desc="" edc:mask="0x1" edc:name="X23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X24" edc:desc="" edc:mask="0x1" edc:name="X24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X25" edc:desc="" edc:mask="0x1" edc:name="X25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X26" edc:desc="" edc:mask="0x1" edc:name="X26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X27" edc:desc="" edc:mask="0x1" edc:name="X27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X28" edc:desc="" edc:mask="0x1" edc:name="X28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X29" edc:desc="" edc:mask="0x1" edc:name="X29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X30" edc:desc="" edc:mask="0x1" edc:name="X30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X31" edc:desc="" edc:mask="0x1" edc:name="X31" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CRCDAT32" edc:desc="" edc:name="CRCDAT32" edc:nzwidth="0x20">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Integer"/>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCDATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="CRCDATL" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="CRCDAT"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CRCDATL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCDATL" edc:nzwidth="16"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCDATH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="CRCDATH" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CRCDATH" edc:desc="" edc:mask="0xffff" edc:name="CRCDATH" edc:nzwidth="16"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCWDATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="CRCWDATL" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CRCWDAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCWDATL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCWDATL" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCWDATH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="CRCWDATH" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCWDATH" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCWDATH" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----rrr-----rrr" edc:cname="CMSTAT" edc:desc="" edc:impl="0xe707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-----00------00" edc:name="CMSTAT" edc:nzwidth="0x10" edc:por="0-----00------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C3OUT" edc:desc="" edc:mask="0x1" edc:name="C3OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="C1EVT" edc:desc="" edc:mask="0x1" edc:name="C1EVT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2EVT" edc:desc="" edc:mask="0x1" edc:name="C2EVT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C3EVT" edc:desc="" edc:mask="0x1" edc:name="C3EVT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMIDL" edc:desc="" edc:mask="0x1" edc:name="CMIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:FreezeBit edc:freezeval="1" edc:name="COMPARATOR" edc:pos="0xe"/>
        </edc:SFRDef>
